{
  "官方文档": "Official Documentation",
  "Yak 语言": "Yak Language",
  "关于我们": "About Us",
  "渗透测试": "Pentest-Wiki",
  "合作伙伴": "Partners",
  "下载白皮书": "Download the White Paper",
  "为网络安全而生的领域编程语言": "Cyber-security Domain-Specific Language",
  "YAK 语言环境配置": "Configuration of Yak Environment",
  "搭建教程": "Quick Start",
  "下载YAK IDE (Yakit)": "Download Yakit (Yak IDE)",
  "安装说明": "Installation Guide",
  "版本": "Version",
  "高效": "Efficient",
  "自动补全": "Auto-completion",
  "函数级调用": "Function-level Invocation",
  "高阶工具": "Advanced Tools",
  "网络安全领域的首个DSL": "The 1st Cyber-security Domain-Specific Language",
  "运行效率极高": "Extremely High Runtime Efficiency",
  "是谷歌支持的开源编程语言": "is a Google-supported open-source programming language",
  "可能是安全领域最先进的 DSL": "may be the most advanced CDSL",
  "一个高质量的Java 生态教学网站": "a high-quality teaching website for the JAVA ecosystem",
  "安全领域的语言集成与函数级调用": "Security Capability Language Native-Integration and <span class=\"content-orange\">Function-Level Calling/Invocation</span>",
  "自动补全与完善的教程文档为编写助力": "Copilot with <span class=\"content-orange\">auto-completion</span> and comprehensive tutorial",
  "高阶函数级集成": "Higher-order <span class=\"content-orange\">Function</span> Integration",
  "与 vscode 兼容的自动补全插件，辅助用户快速上手": "VSCode auto-completion plugin supported",
  "完善的教程文档提供全面指导": "Comprehensive tutorial documents can give comprehensive guidance",
  "多协议、反连平台集成": "Integration of Multi-protocol and Reverse Connection Platforms",
  "HTTP / RMI / LDAP 多协议复用": "Reuse of HTTP/RMI/LDAP Protocols",
  "TCP 随机端口(专利技术) / ICMP 反连 / 内置 DNSLog API": "TCP Random Port（Patented Technology）/ Reverse Connection of ICMP/ Built-in DNSLog API",
  "MITM 劫持平台集成与热加载结合(专利技术)": "Integration of hijacking platform MITM is combined with hot-loading（Patented technology）",
  "Yakit-CDSL的最佳实践": "Yakit-Best Practice of <span class=\"function-body-header-orange\">CDSL</span>",
  "专注于安全领域，使用 DSL 模式提供安全领域能力基座和技术解决方案：漏洞扫描，反连检测，劫持手动测试，特殊协议支持，一应俱全": "Yakit focuses on cyber security and uses DSL patterns to provide users with security capabilities and technical solutions including vulnerability scanning, reverse connection detection, manual testing for hijacking, special protocol support and so on",
  "常见安全工具的最佳实践 GUI": "The Best Practice for GUI of Commonly Used Security Tools",
  "难以复制的 MITM 被动扫描 GUI": "Difficult-to-replicate MITM Passive Scanning GUI",
  "可选择插件执行端口扫描": "Select  Plugin and Port Scanning Execution",
  "常见安全工具右键联动": "Right-click Linkage of Common Security Tools",
  "查看文档": "View Documentation",
  "嵌入式执行并随时热加载": "Embedded Execution with Hot-reloading at Any Time",
  "通过嵌入 Yaklang 脚本来实现 MITM 动态调试流量，随时动态执行代码": "MITM can dynamically debug traffic for MITM and execute code dynamically at any time through embedded Yaklang scripts",
  "与BurpS**te 一致的操作流": "Its  workflow is consistent with BurpSuite",
  "劫持 => History => Repeater / Intruder": "Hijacking => History => Repeater / Intruder",
  "与经典渗透测试操作流一致的国研产品": "It is a Chinese-developed product whose penetration testing workflow is consistent with the classic methodology",
  "独一无二的 Web Fuzzer 与 Fuzz 语法": "Unique Web Fuzzer and Fuzz Syntax",
  "使用 fuzz 语法整合并代替 Repeater 与 Intruder": "It uses fuzz syntax to integrate and replace Repeater and Intruder",
  "高度插件化": "Highly Pluginable",
  "用户可以在渗透测试任何步骤内执行自定义的 Yaklang 脚本或插件": "Users can execute customized Yaklang scripts or plugins at any step during penetration testing",
  "插件仓库与插件商店机制为 “社区化” 助力": "The plugin repository and app store mechanisms provide support for community-driven development",
  "立即体验": "Try now",
  "不管您是行业用户，还是高校学生，Yak 永远是您的好伙伴": "Whether you are an industry user or a student, Yak will always be your good partner",
  "下载桌面端": "Download Desktop Client",
  "查看安装教程": "View Installation Tutorial",
  "电子科技大学网络空间安全研究院描述": "<span class=\"safety-body-content-color\">The Institute for Cyber Security of the University of Electronic Science and Technology of China</span> is one of the earliest institutes in China to systematically carry out research on computer systems and cyber security. It innovatively puts forward an Active Cyber-security Model with <span class=\"safety-body-content-color\">\"Intelligence\", \"Analysis\" and \"Liveliness\"</span> as its core elements, and continues to carry out basic and pioneering exploration and practice in this field.. It has taken the lead in winning the first prize for the National Science and Technology Progress Award in 2019 and the second prize for the National Science and Technology Progress Award in 2012. It was the 3-time winner of the first prize for provincial and ministerial Science and Technology Progress Award and 2-time winner of the first prize for provincial and ministerial Technological Invention. It was selected as the outstanding achievement of projects supported by the 13th Five-Year Plan National Natural Science Foundation. 400 high-level academic papers and many books have been published. <span class=\"safety-body-content-color\">CDSL-YAK is the first domestic open-source domain-specific language in the field of cyber security</span>, which was initiated by the core members of <span class=\"safety-body-content-color\">\"Cohesion Studio\"</span> founded by the Institute for Cyber Security and has developed for many years. ",
  "2项": "2",
  "国家级奖项": "National Awards",
  "5项": "5",
  "省级奖项": "Provincial Awards",
  "学术论文": "Academic Papers",
  "学术著作": "Academic Works",
  "多部": "Lots of",
  "团队": "team",
  "做难且正确的事": "Do the hard and right thing",
  "特别顾问": "Specially Invited Counselors",
  "“电子科技大学，长江学者特聘教授，博士生导师。 2020 第二届全国创新争先奖和 2017 国家网络安全优秀人才奖获得者，国家重点研发计划网络空间安全专项首席科学家。”": "“He is known as a Changjiang Scholar Distinguished Professor and a doctoral supervisor of University of Electronic Science and Technology of China. He was a winner of the Second National Innovation Excellence Award in 2020 and  the National Cyber-security Outstanding Talent Award in 2017. He is also the chief scientist of the national key R&D program cyberspace security. ”",
  "@电子科技大学网络空间安全研究院": "@Institute for Cyber Security of  the University of Electronic Science and Technology of China",
  "YAK 生态共建杰出贡献成员": "Outstanding Contributors in YAK Ecological Co-construction",
  "特别致谢": "Acknowledgements",
  "感谢各位合作伙伴的支持，以下合作伙伴排序不分先后": "Thank you for your support and the following names are arranged in no particular order"
}
